cypress/fixtures/mtn_test_data.json

{
  "testData": [
    {
      "payer": "94713579028",
      "merchant": "94760000000"
    }
    ],

  "invalidId": [
    {
      "title": "Invalid transactionId",
      "transactionId": "5ceRbaa7-8Ed0-a9-b1-8eb9ecc7bA",
      "expectedStatus": 400
    }
  ],
  "invalidData": [
    {
      "title": "Invalid amount",
      "body": { "mtn[amount]": "ABC"},
      "expectedStatus": 400,
      "expectedMessage": "Invalid request body"

    },
    {
      "title": "Invalid phone number format for customerPhone",
      "body": { "mtn[customerPhone]": "invalid_number"},
      "expectedStatus": 500,
      "expectedMessage": "Unsupported transaction type: PAYMENT"
    },
    {
      "title": "Invalid phone number for merchantMobile",
      "body": { "mtn[merchantMobileNo]": "invalid_number"},
      "expectedStatus": 500,
      "expectedMessage": "Unsupported transaction type: PAYMENT"
    },
  {
    "title": "Exceeding maximum transaction limit",
    "body": {"mtn[amount]": 1000000000000000000000000000000.0 },
    "expectedStatus": 500,
    "expectedMessage": "Unsupported transaction type: PAYMENT"
  },
    {
      "title": "Empty phone number for customerPhone",
      "body": { "mtn[customerPhone]": " "},
      "expectedStatus": 500,
      "expectedMessage": "Unsupported transaction type: PAYMENT"
    },
    {
      "title": "Empty phone number for merchantMobile",
      "body": { "mtn[merchantMobileNo]": " "},
      "expectedStatus": 500,
      "expectedMessage": "Unsupported transaction type: PAYMENT"
    },
  {
    "title": "Empty amount field",
    "body": { "mtn[amount]": " " },
    "expectedStatus": 400,
    "expectedMessage": "Invalid request body"
  }
  ],
  "requestToPayPayer": [
      {
        "title": "failed payment request",
        "payer": "46733123450",
        "reason":"INTERNAL_PROCESSING_ERROR"
      },
      {
        "title": "rejected payment request",
        "payer": "46733123451",
        "reason":"APPROVAL_REJECTED"
      },
      {
        "title": "expired payment request",
        "payer": "46733123452",
        "reason":"EXPIRED"
      },
      {
        "title": "non-existent payer",
        "payer": "46733123455",
        "reason":"PAYER_NOT_FOUND"
      },
      {
        "title": "payee not allowed to receive",
        "payer": "46733123456",
        "reason":"PAYEE_NOT_ALLOWED_TO_RECEIVE"
      },
      {
        "title": "payer not allowed to initiate",
        "payer": "46733123457",
        "reason":"NOT_ALLOWED"
      },
      {
        "title": "invalid target environment",
        "payer": "46733123458",
        "reason":"NOT_ALLOWED_TARGET_ENVIRONMENT"
      },
      {
        "title": "invalid callback URL host",
        "payer": "46733123459",
        "reason":"INVALID_CALLBACK_URL_HOST"
      },
      {
        "title": "invalid currency in payment request",
        "payer": "46733123460",
        "reason":"INVALID_CURRENCY"
      },
      {
        "title": "internal processing error",
        "payer": "46733123461",
        "reason":"INTERNAL_PROCESSING_ERROR"
      },
      {
        "title": "service unavailable scenario",
        "payer": "46733123462",
        "reason":"SERVICE_UNAVAILABLE"
      },
      {
        "title": "transaction failure",
        "payer": "46733123463",
        "reason":"COULD_NOT_PERFORM_TRANSACTION"
      }
    ],


  "AccountHolderActivePartyCode": [
  {
    "title": "AccountHolderActivePartyCodeNotFound",
    "transactionId": "5cecbaa7-8bd0-4fa9-87b1-8eb9ecc7b12a"
  },
  {
    "title": "AccountHolderActivePartyCodeNotActive",
    "transactionId": "b0040b3c-b426-4a90-af6e-673e65861cd7"
  },
  {
    "title": "AccountHolderActivePartyCodeNotAllowed",
    "transactionId": "4d5f500f-c385-4901-9be5-25b6d36ad220"
  },
  {
    "title": "AccountHolderActivePartyCodeNotAllowedTargetEnvironment",
    "transactionId": "d2265f9b-0c22-496d-908f-79a65ad66266"
  },
  {
    "title": "AccountHolderActivePartyCodeInternalProcessingError",
    "transactionId": "8f548a78-ceb8-4d12-a243-5640b91e91a4"
  },
  {
    "title": "AccountHolderActivePartyCodeServiceUnavailable",
    "transactionId": "585c07a4-2c80-42f7-9e73-e586b36dee68"
  }
],
  "refundTestData": [
    {
      "payer": "94713579067",
      "merchant": "94760000000"
    }
  ],
  "invalidRefundData": [
    {
      "title": "Invalid transactionId",
      "body": { "mtn[transactionId]": "INVALID_TRANSACTION_ID"},
      "expectedStatus":500,
      "expectedMessage": "Transaction not found for refund"
    },
    {
      "title": "Empty payment Type",
      "body": { "mtn[paymentMethod]": " "},
      "expectedStatus":400,
      "expectedMessage": "Unsupported payment method"
    },
    {
      "title": "Empty transactionId",
      "body": { "mtn[transactionId]": " "},
      "expectedStatus":500,
      "expectedMessage": "Transaction not found for refund"
    }
  ],
  "requestPayer": [
    {
      "title": "Ongoing payment request",
      "payer": "46733123453",
      "merchant": "94760000000"
    },
    {
      "title": "delayed payment request",
      "payer": "46733123454",
      "merchant": "94760000000"
    }
  ],

  "errortest": [
    {
      "title": "failed payment request",
      "payer": "46733123450",
      "reason":"INTERNAL_PROCESSING_ERROR"
    },
    {
      "title": "rejected payment request",
      "payer": "46733123451",
      "reason":"APPROVAL_REJECTED"
    }
  ]
}